{{
  config(
    materialized = 'table')
}}

/* 
vdc - ведомость договорной цены объектов. Объединение нескольких контрактных ведомостей
*/
WITH vdc as(
    select 
        "Наименование работ и затрат",
        "Шифр единичной расценки",
        concat("Шифр единичной расценки",'    ',"Наименование работ и затрат") as "Позиция из КВ",
        replace("Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        "object"
    from {{source('excel', 'raw_excel__vdc_ad108')}} vdc_108
    where "Шифр единичной расценки" != ''

    /*
    условие < != '' > убирает строки без контрактных позиций
    */

    UNION

    select
        vdc_069."Наименование работ и затрат",
        vdc_069."Шифр единичной расценки",
        concat(vdc_069."Шифр единичной расценки",'    ',vdc_069."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_069."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_069."object"
    from {{source('excel', 'raw_excel__vdc_ad069')}} vdc_069
    where vdc_069."Шифр единичной расценки" != ''


    UNION

    select
        vdc_069_1."Наименование работ и затрат",
        vdc_069_1."Шифр единичной расценки",
        concat(vdc_069_1."Шифр единичной расценки",'    ',vdc_069_1."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_069_1."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_069_1."object"
    from {{source('excel', 'raw_excel__vdc_ad069_1')}} vdc_069_1
    where vdc_069_1."Шифр единичной расценки" != ''


    UNION

    select
        vdc_095."Наименование работ и затрат",
        vdc_095."Шифр единичной расценки",
        concat(vdc_095."Шифр единичной расценки",'    ',vdc_095."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_095."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_095."object"
    from {{source('excel', 'raw_excel__vdc_ad095')}} vdc_095
    where vdc_095."Шифр единичной расценки" != ''


    UNION

    select
        vdc_080."Наименование работ и затрат",
        vdc_080."Шифр единичной расценки",
        concat(vdc_080."Шифр единичной расценки",'    ',vdc_080."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_080."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_080."object"
    from {{source('excel', 'raw_excel__vdc_ad080')}} vdc_080
    where vdc_080."Шифр единичной расценки" != ''


    UNION

    select
        vdc_101."Наименование работ и затрат",
        vdc_101."Шифр единичной расценки",
        concat(vdc_101."Шифр единичной расценки",'    ',vdc_101."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_101."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_101."object"
    from {{source('excel', 'raw_excel__vdc_ad101')}} vdc_101
    where vdc_101."Шифр единичной расценки" != ''


    UNION

    select
        vdc_076."Наименование работ и затрат",
        vdc_076."Шифр единичной расценки",
        concat(vdc_076."Шифр единичной расценки",'    ',vdc_076."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_076."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_076."object"
    from {{source('excel', 'raw_excel__vdc_ad076')}} vdc_076
    where vdc_076."Шифр единичной расценки" != ''
      

    UNION
--Казань м12 8 этап
    select
        vdc_089."Наименование работ и затрат",
        vdc_089."Шифр единичной расценки",
        concat(vdc_089."Шифр единичной расценки",'    ',vdc_089."Наименование работ и затрат") as "Позиция из КВ",
        replace(vdc_089."Стоимость работ, руб. без НДС", ' ', '') as "СМР П",
        vdc_089."object"
    from {{source('excel', 'raw_excel__vdc_ad089')}} vdc_089
    where vdc_089."Шифр единичной расценки" != ''

    )
SELECT *,
concat("Шифр единичной расценки",'   ', "object") unique_test
FROM vdc